---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctSettings.FittingAnnotationSize
source: html/ad1cbd39-b54e-6532-3db4-4621d0158663.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSettings.FittingAnnotationSize Property

The value of fitting annotation size.

## Syntax (C#)
```csharp
public double FittingAnnotationSize { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for fittingAnnotationSize must be no more than 30000 feet in absolute value.